meeting/agenda/2023/02-07.org
:PROPERTIES:
:ID:       A2E611B5-74DF-4936-BCFB-2E75460CA14D
:END:
#+title: QT4 CG Meeting 021 Agenda 2023-02-07
#+author: Norm Tovey-Walsh
#+filetags: :qt4cg:
#+options: html-style:nil h:6 toc:nil
#+html_head: <link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
#+html_head: <link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
#+html_head: <link rel="shortcut icon" href="/img/QT4-64.png" />
#+html_head: <link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
#+html_head: <link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
#+options: author:nil email:nil creator:nil timestamp:nil
#+startup: showall

* Agenda
:PROPERTIES:
:unnumbered: t
:CUSTOM_ID: agenda
:END:

This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).

See the [[https://qt4cg.org/meeting/logistics.html][meeting logistics]] page for details.

* Administrivia
:PROPERTIES:
:CUSTOM_ID: administrivia
:END:

** Roll call
:PROPERTIES:
:CUSTOM_ID: roll-call
:END:

** Approve the agenda
:PROPERTIES:
:CUSTOM_ID: accept-agenda
:END:

** Approve minutes of previous meeting
:PROPERTIES:
:CUSTOM_ID: approve-minutes
:END:

Minutes of [[../../minutes/2023/01-31.html][the previous meeting]].

** Next meeting
:PROPERTIES:
:CUSTOM_ID: next-meeting
:END:

This meeting is planned for
7 February,
the following meeting is scheduled for
14 February.

Regrets for the following meeting?

** Review of open action items [0/12]
:PROPERTIES:
:CUSTOM_ID: open-actions
:END:

(Items marked [X] are believed to have been closed via email before
this agenda was posted.)

+ [ ] QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group
+ [ ] QT4CG-016-02: NW to add an ed-note indicating when it was approved.
+ [ ] QT4CG-016-06: RD to reword the introduction to mapping to clarify who’s doing the mapping
+ [ ] QT4CG-016-07: NW to make an issue about the problems of document-uri uniqueness
+ [ ] QT4CG-016-08: RD to clarify how namespace comparisons are performed.
+ [ ] QT4CG-016-09: RD to add a note stating that the local name should always be lowercase
+ [ ] QT4CG-016-10: RD to consider how to clarify /parsed/ entity parsing.
+ [ ] QT4CG-019-01: MK to fix the type of ~$pattern~ in ~fn:tokenize()~
+ [ ] QT4CG-020-01: MK to check if the default for ~type-variety~ is correct.
+ [ ] QT4CG-020-02: MK to review the description of the ~equal-strings~ function
+ [ ] QT4CG-020-03: MK to add examples using options.
+ [ ] QT4CG-020-03: MK to add an option to return false instead of raising an error

* Technical Agenda
:PROPERTIES:
:CUSTOM_ID: technical-agenda
:END:

** Issue #307, parsing and building URIs comments and queries 
:PROPERTIES:
:CUSTOM_ID: h-0032B671-656D-4130-A024-3365933EADB6
:END:

See [[https://qt4cg.org/dashboard/#pr-307][pull request #307]].

** PR #320: Issue 98 - add options parameter to fn:deep-equal
:PROPERTIES:
:CUSTOM_ID: h-8455483D-D0AF-499A-A74A-552B33A9F395
:END:

See [[https://qt4cg.org/dashboard/#pr-320][pull request #320]]. We reviewed this last week with an eye towards
getting approval this week.

** PR #289: Proposal to add fallback behaviour to map:get and array:get
:PROPERTIES:
:CUSTOM_ID: h-0BCF3769-7D91-45D1-8D2E-12E48F9E6757
:END:

See [[https://qt4cg.org/dashboard/#pr-289][pull request #289]].

** PR #330: Update fn:parse-html to apply review feedback.
:PROPERTIES:
:CUSTOM_ID: h-F2F35033-A57A-4FE6-B7ED-CF7A4B15983D
:END:

See [[https://qt4cg.org/dashboard/#pr-330][pull request #330]].

** Issue #299 (formerly #281)
:PROPERTIES:
:CUSTOM_ID: h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C
:END:

We had [[https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-281][some discussion]] of [[https://github.com/qt4cg/qtspecs/issues/281][#281]] previously, but no resolution. Awaiting
more feedback from the CG in the issue.

** XPath 4.0 functions
:PROPERTIES:
:CUSTOM_ID: xpath-40-functions
:END:

*** fn:duplicate-values
:PROPERTIES:
:CUSTOM_ID: fn-duplicate-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/123][#123]]
+ See also [[../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1][discussion from the meeting on 4 October 2022]]

*** fn:replace (action) 
:PROPERTIES:
:CUSTOM_ID: fn-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace

*** fn:format-number (minor fixes)
:PROPERTIES:
:CUSTOM_ID: fn-format-number
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number

*** fn:json
:PROPERTIES:
:CUSTOM_ID: fn-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json

*** fn:differences
:PROPERTIES:
:CUSTOM_ID: fn-differences
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences

Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.

*** fn:stack-trace
:PROPERTIES:
:CUSTOM_ID: fn-stack-trace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace

*** +map:group-by+
:PROPERTIES:
:CUSTOM_ID: map-group-by
:END:
+ +See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by+

Superceded by [[https://github.com/qt4cg/qtspecs/pull/203][map:build]], per [[https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html][MK]].

*** map:replace
:PROPERTIES:
:CUSTOM_ID: map-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace

*** map:substitute
:PROPERTIES:
:CUSTOM_ID: map-substitute
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute

*** map:entries
:PROPERTIES:
:CUSTOM_ID: map-entries
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]] and [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:replace
:PROPERTIES:
:CUSTOM_ID: array-replace
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace

*** array:slice
:PROPERTIES:
:CUSTOM_ID: array-slice
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice

*** array:partition
:PROPERTIES:
:CUSTOM_ID: array-partition
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition

*** fn:split-by-graphemes
:PROPERTIES:
:CUSTOM_ID: fn-split-by-graphemes
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/73][#73]]

*** fn:deep-normalize-space
:PROPERTIES:
:CUSTOM_ID: fn-deep-normalize-space
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/79][#79]]

*** fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels
:PROPERTIES:
:CUSTOM_ID: fn-parcel-etc
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/113][#113]]

*** array:values, map:values
:PROPERTIES:
:CUSTOM_ID: array-values-map-values
:END:
+ See [[https://github.com/qt4cg/qtspecs/issues/29][#29]]

*** fn:distinct-values (semantics)
:PROPERTIES:
:CUSTOM_ID: fn-distinct-values
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values

*** fn:deep-equal (options)
:PROPERTIES:
:CUSTOM_ID: fn-deep-equal
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal

*** fn:parse-json (number formatting)
:PROPERTIES:
:CUSTOM_ID: fn-parse-json
:END:
+ See https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json

* Any other business
:PROPERTIES:
:CUSTOM_ID: any-other-business
:END:
