meeting/agenda/2023/02-07.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>QT4 CG Meeting 021 Agenda 2023-02-07</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="/meeting/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="../../../css/style.css"/>
<link rel="shortcut icon" href="/img/QT4-64.png" />
<link rel="apple-touch-icon" sizes="64x64" href="/img/QT4-64.png" type="image/png" />
<link rel="apple-touch-icon" sizes="76x76" href="/img/QT4-76.png" type="image/png" />
<link rel="apple-touch-icon" sizes="120x120" href="/img/QT4-120.png" type="image/png" />
<link rel="apple-touch-icon" sizes="152x152" href="/img/QT4-152.png" type="image/png" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">QT4 CG Meeting 021 Agenda 2023-02-07</h1>

<div id="outline-container-agenda" class="outline-2">
<h2 id="agenda">Agenda</h2>
<div class="outline-text-2" id="text-agenda">
<p>
This meeting will be hosted on Zoom at 16:00GMT (17:00CET, 11:00EST).
</p>

<p>
See the <a href="https://qt4cg.org/meeting/logistics.html">meeting logistics</a> page for details.
</p>
</div>
</div>

<div id="outline-container-administrivia" class="outline-2">
<h2 id="administrivia"><span class="section-number-2">1.</span> Administrivia</h2>
<div class="outline-text-2" id="text-administrivia">
</div>

<div id="outline-container-roll-call" class="outline-3">
<h3 id="roll-call"><span class="section-number-3">1.1.</span> Roll call</h3>
<div class="outline-text-3" id="text-roll-call">
</div>
</div>

<div id="outline-container-accept-agenda" class="outline-3">
<h3 id="accept-agenda"><span class="section-number-3">1.2.</span> Approve the agenda</h3>
<div class="outline-text-3" id="text-accept-agenda">
</div>
</div>

<div id="outline-container-approve-minutes" class="outline-3">
<h3 id="approve-minutes"><span class="section-number-3">1.3.</span> Approve minutes of previous meeting</h3>
<div class="outline-text-3" id="text-approve-minutes">
<p>
Minutes of <a href="../../minutes/2023/01-31.html">the previous meeting</a>.
</p>
</div>
</div>

<div id="outline-container-next-meeting" class="outline-3">
<h3 id="next-meeting"><span class="section-number-3">1.4.</span> Next meeting</h3>
<div class="outline-text-3" id="text-next-meeting">
<p>
This meeting is planned for
7 February,
the following meeting is scheduled for
14 February.
</p>

<p>
Regrets for the following meeting?
</p>
</div>
</div>

<div id="outline-container-open-actions" class="outline-3">
<h3 id="open-actions"><span class="section-number-3">1.5.</span> Review of open action items <code>[0/12]</code></h3>
<div class="outline-text-3" id="text-open-actions">
<p>
(Items marked [X] are believed to have been closed via email before
this agenda was posted.)
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> QT4CG-002-10: BTW to coordinate some ideas about improving diversity in the group</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-02: NW to add an ed-note indicating when it was approved.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-06: RD to reword the introduction to mapping to clarify who’s doing the mapping</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-07: NW to make an issue about the problems of document-uri uniqueness</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-08: RD to clarify how namespace comparisons are performed.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-09: RD to add a note stating that the local name should always be lowercase</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-016-10: RD to consider how to clarify <i>parsed</i> entity parsing.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-019-01: MK to fix the type of <code>$pattern</code> in <code>fn:tokenize()</code></li>
<li class="off"><code>[&#xa0;]</code> QT4CG-020-01: MK to check if the default for <code>type-variety</code> is correct.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-020-02: MK to review the description of the <code>equal-strings</code> function</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-020-03: MK to add examples using options.</li>
<li class="off"><code>[&#xa0;]</code> QT4CG-020-03: MK to add an option to return false instead of raising an error</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-technical-agenda" class="outline-2">
<h2 id="technical-agenda"><span class="section-number-2">2.</span> Technical Agenda</h2>
<div class="outline-text-2" id="text-technical-agenda">
</div>

<div id="outline-container-h-0032B671-656D-4130-A024-3365933EADB6" class="outline-3">
<h3 id="h-0032B671-656D-4130-A024-3365933EADB6"><span class="section-number-3">2.1.</span> Issue #307, parsing and building URIs comments and queries</h3>
<div class="outline-text-3" id="text-h-0032B671-656D-4130-A024-3365933EADB6">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-307">pull request #307</a>.
</p>
</div>
</div>

<div id="outline-container-h-8455483D-D0AF-499A-A74A-552B33A9F395" class="outline-3">
<h3 id="h-8455483D-D0AF-499A-A74A-552B33A9F395"><span class="section-number-3">2.2.</span> PR #320: Issue 98 - add options parameter to fn:deep-equal</h3>
<div class="outline-text-3" id="text-h-8455483D-D0AF-499A-A74A-552B33A9F395">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-320">pull request #320</a>. We reviewed this last week with an eye towards
getting approval this week.
</p>
</div>
</div>

<div id="outline-container-h-0BCF3769-7D91-45D1-8D2E-12E48F9E6757" class="outline-3">
<h3 id="h-0BCF3769-7D91-45D1-8D2E-12E48F9E6757"><span class="section-number-3">2.3.</span> PR #289: Proposal to add fallback behaviour to map:get and array:get</h3>
<div class="outline-text-3" id="text-h-0BCF3769-7D91-45D1-8D2E-12E48F9E6757">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-289">pull request #289</a>.
</p>
</div>
</div>

<div id="outline-container-h-F2F35033-A57A-4FE6-B7ED-CF7A4B15983D" class="outline-3">
<h3 id="h-F2F35033-A57A-4FE6-B7ED-CF7A4B15983D"><span class="section-number-3">2.4.</span> PR #330: Update fn:parse-html to apply review feedback.</h3>
<div class="outline-text-3" id="text-h-F2F35033-A57A-4FE6-B7ED-CF7A4B15983D">
<p>
See <a href="https://qt4cg.org/dashboard/#pr-330">pull request #330</a>.
</p>
</div>
</div>

<div id="outline-container-h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C" class="outline-3">
<h3 id="h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C"><span class="section-number-3">2.5.</span> Issue #299 (formerly #281)</h3>
<div class="outline-text-3" id="text-h-EF7A6EB3-0BDC-4E8E-A805-8461FD43964C">
<p>
We had <a href="https://qt4cg.org/meeting/minutes/2022/12-13.html#issue-281">some discussion</a> of <a href="https://github.com/qt4cg/qtspecs/issues/281">#281</a> previously, but no resolution. Awaiting
more feedback from the CG in the issue.
</p>
</div>
</div>

<div id="outline-container-xpath-40-functions" class="outline-3">
<h3 id="xpath-40-functions"><span class="section-number-3">2.6.</span> XPath 4.0 functions</h3>
<div class="outline-text-3" id="text-xpath-40-functions">
</div>

<div id="outline-container-fn-duplicate-values" class="outline-4">
<h4 id="fn-duplicate-values"><span class="section-number-4">2.6.1.</span> fn:duplicate-values</h4>
<div class="outline-text-4" id="text-fn-duplicate-values">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/123">#123</a></li>
<li>See also <a href="../../minutes/2022/10-04.html#h-782DCD58-658F-44BC-8AD7-1EE8301228F1">discussion from the meeting on 4 October 2022</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-replace" class="outline-4">
<h4 id="fn-replace"><span class="section-number-4">2.6.2.</span> fn:replace (action)</h4>
<div class="outline-text-4" id="text-fn-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-format-number" class="outline-4">
<h4 id="fn-format-number"><span class="section-number-4">2.6.3.</span> fn:format-number (minor fixes)</h4>
<div class="outline-text-4" id="text-fn-format-number">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-format-number</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-json" class="outline-4">
<h4 id="fn-json"><span class="section-number-4">2.6.4.</span> fn:json</h4>
<div class="outline-text-4" id="text-fn-json">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-json</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-differences" class="outline-4">
<h4 id="fn-differences"><span class="section-number-4">2.6.5.</span> fn:differences</h4>
<div class="outline-text-4" id="text-fn-differences">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-differences</a></li>
</ul>

<p>
Editorially, this function is not ready for approval. We should decide
if we want to pursue it, and if we do, how.
</p>
</div>
</div>

<div id="outline-container-fn-stack-trace" class="outline-4">
<h4 id="fn-stack-trace"><span class="section-number-4">2.6.6.</span> fn:stack-trace</h4>
<div class="outline-text-4" id="text-fn-stack-trace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-stack-trace</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-group-by" class="outline-4">
<h4 id="map-group-by"><span class="section-number-4">2.6.7.</span> <del>map:group-by</del></h4>
<div class="outline-text-4" id="text-map-group-by">
<ul class="org-ul">
<li><del>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-group-by</a></del></li>
</ul>

<p>
Superceded by <a href="https://github.com/qt4cg/qtspecs/pull/203">map:build</a>, per <a href="https://lists.w3.org/Archives/Public/public-xslt-40/2022Oct/0037.html">MK</a>.
</p>
</div>
</div>

<div id="outline-container-map-replace" class="outline-4">
<h4 id="map-replace"><span class="section-number-4">2.6.8.</span> map:replace</h4>
<div class="outline-text-4" id="text-map-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-substitute" class="outline-4">
<h4 id="map-substitute"><span class="section-number-4">2.6.9.</span> map:substitute</h4>
<div class="outline-text-4" id="text-map-substitute">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-map-substitute</a></li>
</ul>
</div>
</div>

<div id="outline-container-map-entries" class="outline-4">
<h4 id="map-entries"><span class="section-number-4">2.6.10.</span> map:entries</h4>
<div class="outline-text-4" id="text-map-entries">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">#29</a> and <a href="https://github.com/qt4cg/qtspecs/issues/113">#113</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-replace" class="outline-4">
<h4 id="array-replace"><span class="section-number-4">2.6.11.</span> array:replace</h4>
<div class="outline-text-4" id="text-array-replace">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-replace</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-slice" class="outline-4">
<h4 id="array-slice"><span class="section-number-4">2.6.12.</span> array:slice</h4>
<div class="outline-text-4" id="text-array-slice">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-slice</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-partition" class="outline-4">
<h4 id="array-partition"><span class="section-number-4">2.6.13.</span> array:partition</h4>
<div class="outline-text-4" id="text-array-partition">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-array-partition</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-split-by-graphemes" class="outline-4">
<h4 id="fn-split-by-graphemes"><span class="section-number-4">2.6.14.</span> fn:split-by-graphemes</h4>
<div class="outline-text-4" id="text-fn-split-by-graphemes">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/73">#73</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-deep-normalize-space" class="outline-4">
<h4 id="fn-deep-normalize-space"><span class="section-number-4">2.6.15.</span> fn:deep-normalize-space</h4>
<div class="outline-text-4" id="text-fn-deep-normalize-space">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/79">#79</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parcel-etc" class="outline-4">
<h4 id="fn-parcel-etc"><span class="section-number-4">2.6.16.</span> fn:parcel, fn:unparcel, array:from-members/of, array:members/parcels</h4>
<div class="outline-text-4" id="text-fn-parcel-etc">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/113">#113</a></li>
</ul>
</div>
</div>

<div id="outline-container-array-values-map-values" class="outline-4">
<h4 id="array-values-map-values"><span class="section-number-4">2.6.17.</span> array:values, map:values</h4>
<div class="outline-text-4" id="text-array-values-map-values">
<ul class="org-ul">
<li>See <a href="https://github.com/qt4cg/qtspecs/issues/29">#29</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-distinct-values" class="outline-4">
<h4 id="fn-distinct-values"><span class="section-number-4">2.6.18.</span> fn:distinct-values (semantics)</h4>
<div class="outline-text-4" id="text-fn-distinct-values">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-distinct-values</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-deep-equal" class="outline-4">
<h4 id="fn-deep-equal"><span class="section-number-4">2.6.19.</span> fn:deep-equal (options)</h4>
<div class="outline-text-4" id="text-fn-deep-equal">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-deep-equal</a></li>
</ul>
</div>
</div>

<div id="outline-container-fn-parse-json" class="outline-4">
<h4 id="fn-parse-json"><span class="section-number-4">2.6.20.</span> fn:parse-json (number formatting)</h4>
<div class="outline-text-4" id="text-fn-parse-json">
<ul class="org-ul">
<li>See <a href="https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json">https://qt4cg.org/specifications/xpath-functions-40/Overview.html#func-parse-json</a></li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-any-other-business" class="outline-2">
<h2 id="any-other-business"><span class="section-number-2">3.</span> Any other business</h2>
<div class="outline-text-2" id="text-any-other-business">
</div>
</div>
</div>
</body>
</html>
